
## Plan Result (sandbox)




<pre><code>Plan: 40 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.app_insights_key
  * azurerm_key_vault_secret.ccd-case-disposer-s2s-secret
  * azurerm_key_vault_secret.ccd-next-hearing-date-updater-s2s-secret
  * azurerm_key_vault_secret.ccd_gw_s2s_secret
  * azurerm_key_vault_secret.dm_store_storageaccount_id
  * azurerm_key_vault_secret.dm_store_storageaccount_primary_access_key
  * azurerm_key_vault_secret.dm_store_storageaccount_primary_connection_string
  * azurerm_key_vault_secret.dm_store_storageaccount_secondary_access_key
  * azurerm_key_vault_secret.dm_store_storageaccount_secondary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.storageaccount_id
  * azurerm_key_vault_secret.storageaccount_primary_access_key
  * azurerm_key_vault_secret.storageaccount_primary_connection_string
  * azurerm_key_vault_secret.storageaccount_secondary_access_key
  * azurerm_key_vault_secret.storageaccount_secondary_connection_string
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.dm_store_storage_account.azapi_update_resource.defender_settings
  * module.dm_store_storage_account.azurerm_storage_account.storage_account
  * module.dm_store_storage_account.random_string.storage_account_random_string
  * module.dm_store_storage_account.time_rotating.rotate
  * module.dm_store_storage_account.time_static.pim_expiry
  * module.dm_store_storage_account.time_static.pim_start
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.storage_account.azapi_update_resource.defender_settings
  * module.storage_account.azurerm_storage_account.storage_account
  * module.storage_account.random_string.storage_account_random_string
  * module.storage_account.time_rotating.rotate
  * module.storage_account.time_static.pim_expiry
  * module.storage_account.time_static.pim_start
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.vault.azurerm_key_vault_access_policy.developer[0]
  * module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.app_insights_key will be created
  + resource "azurerm_key_vault_secret" "app_insights_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AppInsightsInstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ccd-case-disposer-s2s-secret will be created
  + resource "azurerm_key_vault_secret" "ccd-case-disposer-s2s-secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ccd-case-disposer-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ccd-next-hearing-date-updater-s2s-secret will be created
  + resource "azurerm_key_vault_secret" "ccd-next-hearing-date-updater-s2s-secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ccd-next-hearing-date-updater-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ccd_gw_s2s_secret will be created
  + resource "azurerm_key_vault_secret" "ccd_gw_s2s_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ccd-gw-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_id will be created
  + resource "azurerm_key_vault_secret" "dm_store_storageaccount_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dm-store-storage-account-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "dm_store_storageaccount_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dm-store-storage-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "dm_store_storageaccount_primary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dm-store-storage-account-primary-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_secondary_access_key will be created
  + resource "azurerm_key_vault_secret" "dm_store_storageaccount_secondary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dm-store-storage-account-secondary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dm_store_storageaccount_secondary_connection_string will be created
  + resource "azurerm_key_vault_secret" "dm_store_storageaccount_secondary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dm-store-storage-account-secondary-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ccd-servicebus-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storageaccount_id will be created
  + resource "azurerm_key_vault_secret" "storageaccount_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storageaccount_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "storageaccount_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storageaccount_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "storageaccount_primary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-primary-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storageaccount_secondary_access_key will be created
  + resource "azurerm_key_vault_secret" "storageaccount_secondary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-secondary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storageaccount_secondary_connection_string will be created
  + resource "azurerm_key_vault_secret" "storageaccount_secondary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-secondary-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-shared-sandbox"
      + tags     = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#ccd-devops"
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "ccd-sandbox"
      + resource_group_name                   = "ccd-shared-sandbox"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - ccd-sandbox"
      + resource_group_name = "ccd-shared-sandbox"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C6H1N9WRF"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)
        }
    }

  # module.dm_store_storage_account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.dm_store_storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "dmstoredocsandbox"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ccd-shared-sandbox"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#em-dev-chat"
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "Evidence Management"
          + "startupMode"         = "onDemand"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-01",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas",
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-00",
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-01",
            ]
        }
    }

  # module.dm_store_storage_account.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.dm_store_storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.dm_store_storage_account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.dm_store_storage_account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 1
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + minimum_tls_version                 = "1.2"
      + name                                = "ccd-servicebus-sandbox"
      + premium_messaging_partitions        = 1
      + public_network_access_enabled       = true
      + resource_group_name                 = "ccd-shared-sandbox"
      + sku                                 = "Premium"
      + tags                                = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#ccd-devops"
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.storage_account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ccdsharedsandbox"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ccd-shared-sandbox"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#ccd-devops"
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-01",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas",
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-00",
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-01",
            ]
        }
    }

  # module.storage_account.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage_account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "ccd-sandbox"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "ccd-shared-sandbox"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#ccd-devops"
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7df9d173-631b-47a6-8737-0f15616d25f0"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                           = "ccd-sandbox"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ccd-sandbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-sandbox-rg"
      + tags                = {
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#ccd-devops"
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "2025-05-01"
          + "managedBy"           = "CCD"
          + "startupMode"         = "onDemand"
        }
      + tenant_id           = (known after apply)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + appInsightsInstrumentationKey = (sensitive value)
  + dm_store_storage_account_name = "dmstoredocsandbox"
  + storage_account_name          = "ccdsharedsandbox"
  + vaultName                     = "ccd-sandbox"
  + vaultUri                      = (known after apply)
```

</details>




## :warning: Errors

* add a label sandbox/add-or-update: POST https://api.github.com/repos/hmcts/ccd-shared-infrastructure/issues/203/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":203,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->